[
  {
    "name": "Jonah Yip Mathivanan",
    "desc": ["Nobel International School, Alumnus", "Cambridge A Level, MCKL"],
    "quote": "The scholarship has provided me with a real sense of achievement, which has raised my self-esteem. By having a higher level of confidence in my capabilities, I will strive to achieve better results and participate regularly in the various co-curricular activities MCKL has to offer.",
    "img_src": "/images/testimonials/excellence_award_2023-jonah_yip_mathivanan.png"
  },
  {
    "name": "Tifany Chiu Ke Shuen",
    "desc": ["AIM Christian College, Alumna", "Cambridge A Level, MCKL"],
    "quote": "Receiving this Award once again justifies the phrase ‘Nothing is Impossible’. It reminds me that I can achieve anything if I put in my all and persist in trying to achieve my goals.",
    "img_src": "/images/testimonials/excellence_award_2023-tifany_chiu_ke_shuen.png"
  },
  {
    "name": "Loh Zhe Hong",
    "desc": ["SMJK Chung Ling, Alumnus", "Cambridge A Level, MCKL"],
    "quote": "I applied for the Student Leader Scholarship after some encouragement by one of the staff in MCKL. Receiving this scholarship not only boosts my confidence, but it also means a lot to me, as it proves that my hard work throughout the years has finally paid of. It encourages me to continue my effort to strive and do better in the future. I think being active in co-curricular activities and being able to maintain good grades make me a well-rounded person and having the opportunity to hold positions and lead clubs in secondary school also made me a strong applicant for this scholarship.",
    "img_src": "/images/testimonials/excellence_award_2023-loh_zhe_hong.png"
  },
  {
    "name": "Chooi Jia Yue",
    "desc": ["SMK Convent Teluk Intan, Alumna", "Cambridge A Level, MCKL"],
    "quote": "This is the first time I’ve received a full scholarship from a non-government institution. I feel grateful for the scholarship that the school has offered to me, as it makes me more motivated to further study while reducing my parent’s financial burden. It allows me to work on ways to maintain good academic performance in life as well as master time management and become more discipline than my previous self as a preparation to enter a competitive environment in Singapore.",
    "img_src": "/images/testimonials/excellence_award_2023-chooi_jia_yue.png"
  },

  {
    "name": "Marissa Haley Chong",
    "desc": [
      "Stella Maris International School Medan Damansara, Alumna",
      "",
      "Cambridge A Level, MCKL"
    ],
    "quote": "This scholarship gives more space for my dreams to expand and more motivation for me to work for those dreams. It also gives me a little more freedom to explore those goals and recognise my true passion and purpose in life.",
    "img_src": "/images/testimonials/excellence_award_2023-marissa_haley_chong.png"
  },
  {
    "name": "Wong Yue Qing",
    "desc": [
      "Sri Emas International School, Alumna",
      "Cambridge A Level, MCKL"
    ],
    "quote": "This scholarship is a huge push for me to have a chance to soar to my dreams. It'll definitely open up many doors to opportunities for me to experience throughout this whole programme and even further in the future.",
    "img_src": "/images/testimonials/excellence_award_2023-wong_yue_qing.png"
  },
  {
    "name": "Lee Ming-Ze",
    "desc": ["SMJK Sam Tet, Ipoh, Alumnus", "Cambridge A Level"],
    "quote": "This scholarship allows me to continue my studies in Cambridge A Level because I am aiming to further my studies overseas, however, due to my family’s financial status, I am unable to afford the expensive fees in tertiary programmes. Therefore, winning this scholarship enabled me to continue my studies at MCKL and I’m now one step closer to continue my degree in pharmaceutical or actuarial science.",
    "img_src": "/images/testimonials/excellence_award_2023-lee_ming_ze.png"
  },
  {
    "name": "Teong Rooi En",
    "desc": [
      "SMJK Perempuan China Pulau Pinang, Alumna",
      "Cambridge A Level, MCKL"
    ],
    "quote": "I’m truly grateful to be one of the recipients of the scholarship. Firstly, my parents wouldn’t be so financially burdened by my tuition fees, and it also allows me to put all my energy and focus on doing well in my classes. It also makes me feel like my hard work in high school has been affirmed. This scholarship not only allowed me to continue my education but also motivates me to succeed in my goals and aspirations, as well.",
    "img_src": "/images/testimonials/excellence_award_2023-teong_rooi_en.png"
  },
  {
    "name": "Mok Yen Qin",
    "desc": [
      "The IGCSE Learning Centre, Alumna",
      "Australian Matriculation, MCKL"
    ],
    "quote": "I might have to take a gap year before studying as my parent's industry is still not back on track due to the pandemic, but I’m extremely grateful that this scholarship has given me the opportunity to pursue my education as intended.",
    "img_src": "/images/testimonials/excellence_award_2023-mok_yen_qin.png"
  },
  {
    "name": "Vanessa Chong Yi Wen",
    "desc": [
      "Wesley Methodist School Kuala Lumpur (International), Alumna",
      "Cambridge A Level, MCKL"
    ],
    "quote": "The scholarship will undeniably ease my family’s financial burden as well as provide me with additional motivation to perform well in both my studies and my co-curricular activities throughout my time in MCKL.",
    "img_src": "/images/testimonials/excellence_award_2023-vanessa_chong_yi_wen.png"
  },
  {
    "name": "Wong Ching Shuen",
    "desc": [
      "SMJK Perempuan China Pulau Pinang, Alumna",
      "Cambridge A Level, MCKL"
    ],
    "quote": "This scholarship was a confidence boost for me and was a great help to my family financially. Learning that achieving excellence could lessen my family’s financial burden has pushed me to continue to excel no matter where I am.",
    "img_src": "/images/testimonials/excellence_award_2023-wong_ching_shuen.png"
  },
  {
    "name": "Khaw Tze Juin",
    "desc": [
      "SMJK Perempuan China Pulau Pinang, Alumna",
      "Cambridge A Level, MCKL"
    ],
    "quote": "This scholarship reduces a lot of my parents’ financial burden, and is also a recognition towards my academic performance. I think college life is not just all about studies, but how to communicate with people u meet, understand what you really want and learn how to enjoy your life. Academic is important, but most importantly, study hard and play harder!",
    "img_src": "/images/testimonials/excellence_award_2023-khaw_tze_juin.png"
  }
]
