[
  {
    "name": "Ms Wong Poh Swan",
    "slug": "wong_poh_swan",
    "role": "Assistant Head of Department, Diploma in Early Childhood Education",
    "bio": "Poh Swan is currently the Assistant Head and Lecturer, Diploma in Early Childhood Education programme in MCKL. A lawyer turned educator, Wong Poh Swan has nine years of professional experience in the early childhood education industry, during which she was an early childhood educator in an inclusive preschool. Poh Swan holds a Master of Education (Special Education) from University of Southern Queensland, a Certificate in Legal Practice (Legal Profession Qualifying Board Malaysia), a Bachelor of Laws from the University of London and a Diploma in Early Childhood Education from SEGi College Subang Jaya. A well-qualified and dedicated lecturer, Poh Swan’s passion, expertise, and experience in both early childhood education and special needs education gives holistic insights to her students. Poh Swan is a certified Train-the-Trainer from Human Resource Development Corporation (HRD Corp.), Malaysia."
  },
  {
    "name": "Ms Yee Weng Yan",
    "slug": "yee_weng_yan",
    "role": "Lecturer and Coordinator, Cambridge Professional Development Qualifications",
    "bio": "Yee Weng Yan is currently the Programme Leader and Coordinator, Cambridge Professional Development Programmes as well as a Lecturer, Biology in MCKL. She holds a Master of Education from the University of Hong Kong (Curriculum and Pedagogy) and a Bachelor of Science (Hons) with Education from Universiti Putra Malaysia. With over 10 years of teaching experience in both secondary school and pre-university level and having gone through the Cambridge International Certificate for Teachers and Trainers (CIDTT) herself in 2014, Weng Yan understands the joy of teaching and learning and enjoys seeing others grow in their professional practice. Her areas of interest are active pedagogical approaches and assessment for learning. Weng Yan is a certified Train-the-Trainer from Human Resource Development Corporation (HRD Corp.), Malaysia"
  },
  {
    "name": "Adrian Yao",
    "slug": "adrian_yao",
    "role": "Academic Director, External Programmes",
    "remark": {
      "amazon-web-services": "Point of enquiry only*"
    },
    "bio": "Adrian Yao is currently the Academic Director, External Programmes and Head, Teaching and Learning in MCKL. Adrian spent almost two decades as an academic and academic administrator in various private higher learning institutions. He has brought with him a wealth of experience in technological adoption of learning &amp; teaching particularly in higher education, which include digital learning &amp; teaching, blended learning &amp; teaching, online learning &amp; teaching, performing arts &amp; creative media, communication &amp; media-related strategies and importantly understanding the learning &amp; teaching needs of Gen Y, Z and Alpha. Adrian is currently pursuing his Doctor of Philosophy (Arts) with Monash University. Adrian is currently a Board Member to the Cambridge International Education Advisory Board member representing the Southeast Asia and Pacific effective September 2020. Adrian is a certified Train-the-Trainer from Human Resource Development Corporation (HRD Corp.), Malaysia."
  },
  {
    "name": "Dr Gerard Boey",
    "slug": "dr_gerard_boey",
    "role": "Principal cum Academic Dean",
    "bio": "Dr. Gerard Boey is an educator with close to three decades of combined work experience in Engineering, ICT, and Education. He has developed various training programmes for teaching and learning, conduct talks, and workshops. On many occasions, he has trained adult learners, schoolteachers, lecturers, and postgraduate students on Mind Science for Effective Multimedia Presentation to improve their multimedia presentation design skills using Microsoft PowerPoint. Dr Gerard Boey is a graduate of Tunku Abdul Rahman University College and received his BS Microelectronics / Computer Science from Campbell University, USA, MSc in Systems Engineering from Cardiff University, UK and Doctor of Education (Educational Technology and Multimedia), EdD from Universiti Sains Malaysia, Penang. He is also a member of The Institute of Engineering and Technology, UK. His current passion is in the field of ICT-Pedagogy Integration for education and training."
  },
  {
    "name": "Ms Lydia Ong",
    "slug": "lydia_ong",
    "role": "Coordinator, Digital Education Unit (DEU)",
    "bio": "Lydia Ong is currently the Coordinator and Trainer of International Certification of Digital Literacy (ICDL) Programme in MCKL’s Digital Education Unit. A versatile trainer, she holds a Master of Science (Forensic Science) from Universiti Teknologi Malaysia, a Bachelor of Science (Hons) in Microbiology from Universiti Kebangsaan Malaysia and a Cambridge International Diploma for Teachers and Trainers. While she is adept and highly proficient in digital technology with accreditations from ICDL; a globally recognised computer skills certification, Lydia is an educator at heart. With a belief that every individual has a potential to excel and succeed, she has been known by her students to be engaging and approachable. Lydia is a certified Train-the-Trainer from Human Resource Development Corporation (HRD Corp.), Malaysia."
  },
  {
    "name": "Angela Pok Wei Fun",
    "slug": "angela_pok",
    "role": "Chief Executive Officer",
    "bio": "Angela Pok is an experience educationist who has been in the education industry more than 22 years. She joined Methodist College Kuala Lumpur (MCKL) as Chief Executive Officer in 2019 and oversees the operation, management, leadership and strategic planning of MCKL Kuala Lumpur campus and the newly set up Penang Pykett Campus. Prior to joining MCKL, she was the Director of Transnational Education and Strategy of UTM SPACE and the Vice President of Student Experience, Taylor’s University and has vast experience managing high volume of staff and working with diverse staff of different levels. At UTM, she was involved in transnational education engagement and strategy planning where she spearheaded the successful implementation of franchise campuses in six countries, making UTM the first Malaysian public university to offer local degree programmes abroad. She has provided many leadership and strategy training programmes of different sectors and ministries that include Department of Higher Education, Malaysia, Bangladesh Medical Education &amp; Family Welfare Division, Bangladesh Ministry of Food, Bangladesh Ministry of Women &amp; Children Affairs, Bangladesh University Grants Committee, the management staff of UTM SPACE and the key leaders and department heads of MCKL. She has always been passionate about providing positive student experiences that enhance student learning at universities and institutions of higher learning. This has led to her appointment as President of Asia Pacific Student Services Association (APSSA) since 2018, a role which allows her to enhance liaison and collaboration among student services practitioners of the Asia Pacific region. She holds an MBA (e-Commerce) from the University of Southern Queensland and a professional qualification, ICSA and Diploma in Commerce from the Tunku Abdul Rahman University College. Angela is a certified Train-the-Trainer from Human Resource Development Corporation (HRD Corp.), Malaysia."
  },
  {
    "name": "Dr Grace Chua",
    "role": "Head, Early Childhood Education",
    "bio": "Dr. Grace Chua is currently the Head, Diploma in Early Childhood Education programme in MCKL. With more than 25 years of experience in higher education, Dr. Grace specializes in quality assurance, academic standards, and the promotion of strong student learning performance. Having worked with many external university, Dr. Grace Chua has earned a wealth of experience in the evaluation of degree programs, international benchmarking, changing academic work roles, quality assurance processes, and different innovative teaching strategies to the development of academic standards. She is a regular speaker and workshop facilitator on early childhood, career workshops, and academic programme development. Dr. Grace is a certified Programme Leader for the Cambridge International Diploma for Teachers &amp; Trainers. Dr. Grace is a certified Train-the-Trainer from Human Resource Development Corporation (HRD Corp.), Malaysia"
  },
  {
    "name": "Mr Eddryll Teo",
    "slug": "eddryll_teo",
    "profile_pic": "/instructor/eddryll-teo.png",
    "role": "Head, MPU (Mata Pelajaran Umum)"
  },
  {
    "name": "Ms Jolyn Hong",
    "slug": "jolyn_hong",
    "profile_pic": "/instructor/jolyn-hong.png",
    "role": "Head of Department, Diploma in Social Work"
  },
  {
    "name": "Mr Joshua Johnson",
    "slug": "joshua_johnson",
    "profile_pic": "/instructor/joshua-johnson.png",
    "role": " Head, University Placement & Alumni"
  },
  {
    "name": "Oh Hui Xin",
    "role": "Trainer",
    "bio": "With a deep desire to make a difference in the lives of the next generation of learners, Hui Xin left the corporate world of human development and management for a teaching position in several secondary schools. Graduated with a Bachelor of Science (Hons) in Mathematics and Economics from Universiti Malaysia Sabah, and a Postgraduate Diploma in Education, she has served as a teacher for several years under the prestigious Teach for Malaysia Fellowship programme. One who strongly believes that learning ought to be accessible to all, Hui Xin loves to explore new teaching and learning approaches, techniques, and methodologies to engage her 21 st century learners. She enjoys working with teachers and learners of diverse backgrounds and her current areas of interest are collaborative learning, classroom management and student behaviour."
  },
  {
    "name": "Khor Kheng Leik",
    "role": "Academic Director, Tertiary Programmes and Head, American Degree Transfer Programme",
    "bio": "Known fondly as Ms. Khor in the Campus, Khor Kheng Leik is currently the Academic Director, Tertiary Programmes in MCKL. Equipped with more than 30 years of teaching experience and working amongst young children, adolescents and working adults, she is no stranger to the field of academia. She holds a Bachelor of Education from National Chengchi University, Taiwan and a Masters of Education (Human Development and Psychology) from Harvard University, United States of America. While her current teaching focus is to train pre-service teachers in problem-based and inquiry-based pedagogical approach to promote higher order thinking skills among learners, nothing excites her more than to have opportunities to engage in collaborative curriculum development projects in different cultural settings to promote quality education for all learners."
  },
  {
    "name": "Sarasvati A/P Rajindra",
    "role": "Trainer Sarasvati",
    "bio": "Commonly known as Ms. Saras in MCKL, Sarasvati a/p Rajindra is currently the Acting Assistant Head, Teaching &amp; Learning (Academic Success). Sarasvati holds a Master of Education and a Bachelor of Education specializing in Teaching English as Second Language (TESL) respectively from University of Malaya. With a total of 14 years as a full-time lecturer in academic institutions and a language trainer in private corporations, she has extensive experience teaching in all TESL related subjects, English Language Proficiency, Business Communication, Workplace English, General Studies and English Literature. Apart from her keen interest in language and education, Sarasvati is also passionate and committed to research. Saras is a certified Train-the-Trainer from Human Resource Development Corporation (HRD Corp.), Malaysia."
  }
]
